InformationRegisters/ДлительныеДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДлительныеДействия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ID_файла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресФайлаВХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполненоСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеЗавершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИДДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДлительныеДействияЭтап.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДлительныеДействияЭтап</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеЭтапаДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполненоСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИДДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Миллисекунды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДлительныеДействияЗадача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДлительныеДействияЗадача</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДействиПриЗавершении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Задачи_ПКД</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи_РКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИДДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омФайлыPDM/Ext/Module.bsl
Функция ПолучитьТабличныйДокументСтруктураФайлов(КореньЗапроса = "") Экспорт
	 
	 COMОбъект = омPDMНаСервереПовтор.ПодключитьБиблиотекуPDM();
	 
	 Если COMОбъект = Неопределено Тогда
	 
	 	Возврат Неопределено
	 
	 КонецЕсли;
	 
	 Если ПустаяСтрока(КореньЗапроса) Тогда
		 КореньЗапроса = COMОбъект.Root_folder();
	 КонецЕсли;
	 
	 ХМЛФайлыПапки = COMОбъект.Files_folder(КореньЗапроса); 
	 
	 Если НЕ ЗначениеЗаполнено(ХМЛФайлыПапки) Тогда
	 
	 	Возврат Неопределено;	
	 
	КонецЕсли;
	

//ХМЛФайлыПапки ="<files_folders>
//			|  <file_folders name=""EFICAD"">
//			|    <local_path>C:\PDM\EFICAD</local_path>
//			|    <ID>306</ID>
//			|    <this_folder>True</this_folder>
//			|  </file_folders>
//			|  <file_folders name=""Проекты"">
//			|    <local_path>C:\PDM\Проекты</local_path>
//			|    <ID>793</ID>
//			|    <this_folder>True</this_folder>
//			|  </file_folders>
//			|  <file_folders name=""&lt;items&gt;"">
//			|    <local_path>C:\PDM\&lt;items&gt;</local_path>
//			|    <ID>822</ID>
//			|    <this_folder>True</this_folder>
//			|  </file_folders>
//			|  <file_folders name=""БМ"">
//			|    <local_path>C:\PDM\БМ</local_path>
//			|    <ID>8832</ID>
//			|    <this_folder>True</this_folder>
//			|  </file_folders>
//			|  <file_folders name=""1C"">
//			|    <local_path>C:\PDM\1C</local_path>
//			|    <ID>13720</ID>
//			|    <this_folder>True</this_folder>
//			|  </file_folders>
//			|</files_folders> ";	
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ХМЛФайлыПапки);
	
    Пока ЧтениеXML.Прочитать() Цикл
      Если ЧтениеXML.ИмяЭлемента = "Контрагент" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
            
            // Сбрасываем значения для нового контрагента
            ТекНаименование = "";
            ТекИНН = "";
            ТекКПП = "";
            
        ИначеЕсли ЧтениеXML.ИмяЭлемента = "Наименование" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
            ЧтениеXML.Прочитать();
            ТекНаименование = ЧтениеXML.Значение;
            
        ИначеЕсли ЧтениеXML.ИмяЭлемента = "ИНН" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
            ЧтениеXML.Прочитать();
            ТекИНН = ЧтениеXML.Значение;
            
        ИначеЕсли ЧтениеXML.ИмяЭлемента = "КПП" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
            ЧтениеXML.Прочитать();
            ТекКПП = ЧтениеXML.Значение;
            
        // Обрабатываем конец элемента "Контрагент" - создаем элемент
        ИначеЕсли ЧтениеXML.ИмяЭлемента = "Контрагент" И ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
            
            // Создаем нового контрагента
            Попытка
                Если Не ПустаяСтрока(ТекНаименование) Тогда
                    НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
                    НовыйКонтрагент.Наименование = ТекНаименование;
                    НовыйКонтрагент.ИНН = ТекИНН;
                    НовыйКонтрагент.КПП = ТекКПП;
                    НовыйКонтрагент.Записать();
                    Сообщить("Добавлен: " + ТекНаименование);
                КонецЕсли;
            Исключение
                Сообщить("Ошибка при создании контрагента: " + ТекНаименование);
            КонецПопытки;
            
        КонецЕсли;
    КонецЦикла;
 
КонецФункции // ПолучитьТабличныйДокументСтруктураФайлов()

Функция ИнформацияОФайлеPDM(ИД, АдресРезультата = Неопределено) Экспорт

	 COMОбъект = омPDMНаСервереПовтор.ПодключитьБиблиотекуPDM();
	 
	 Если COMОбъект = Неопределено Тогда
	 
	 	Возврат Неопределено
	 
	КонецЕсли;
	
	СтрокаXML = COMОбъект.Get_file_information(ИД);
	
	Если АдресРезультата = Неопределено Тогда
		
		Возврат СтрокаXML;
		
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(СтрокаXML, АдресРезультата);	
	
КонецФункции // ИнформацияОФайлеPDM()

Функция ПолучитьПодПапкиИФайлыИзПапки(ПутьКФалу, АдресРезультата = Неопределено, ПолныйПуть = Истина) Экспорт

	 COMОбъект = омPDMНаСервереПовтор.ПодключитьБиблиотекуPDM();
	 
	 Если COMОбъект = Неопределено Тогда
	 
	 	Возврат Неопределено
	 
	КонецЕсли;
	
	СтрокаXML = COMОбъект.Files_folder(ПутьКФалу, ПолныйПуть);
	
	Если АдресРезультата = Неопределено Тогда
		
		Возврат СтрокаXML;
		
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(СтрокаXML, АдресРезультата);	

КонецФункции // ПолучитьПодПапкиИФайлыИзПапки(ПутьКФалу)

Функция КопированиеФайлаВСтруктуруPDM(ОбъектДействия, АдресВХранилище) Экспорт

	

КонецФункции // КопированиеФайлаВСтруктуруPDM()

Функция ПолучитьЭтапДействия(ОбъектДействия, СтаршеМиллисекунды = 0, ВсеДействия = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДлительныеДействия.ID_файла КАК ID_файла,
		|	ДлительныеДействия.АвторДействия КАК АвторДействия,
		|	ДлительныеДействия.Дата КАК Дата,
		|	ДлительныеДействия.НаименованиеДействия КАК НаименованиеДействия
		|ИЗ
		|	РегистрСведений.ДлительныеДействия КАК ДлительныеДействия
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДлительныеДействияЭтап КАК ДлительныеДействияЭтап
		|		ПО ДлительныеДействия.УИДДействия = ДлительныеДействияЭтап.УИДДействия
		|ГДЕ
		|	ДлительныеДействия.ОбъектДействия = &ОбъектДействия
		|	И ВЫБОР
		|			КОГДА &ВсеДействия
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НЕ ДлительныеДействия.ДействиеЗавершено
		|		КОНЕЦ
		|	И ДлительныеДействияЭтап.Миллисекунды > &Миллисекунды
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДлительныеДействияЭтап.Миллисекунды";
	
	Запрос.УстановитьПараметр("Миллисекунды", 	СтаршеМиллисекунды);
	Запрос.УстановитьПараметр("ВсеДействия", 	ВсеДействия);
	Запрос.УстановитьПараметр("ОбъектДействия", ОбъектДействия);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьЭтапДействия()

Функция ТекущиеДействияЗадачи(Задача, СтаршеМиллисекунды = 0, ВсеДействия = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДлительныеДействия.ID_файла КАК ID_файла,
		|	ДлительныеДействия.АвторДействия КАК АвторДействия,
		|	ДлительныеДействия.Дата КАК Дата,
		|	ДлительныеДействия.НаименованиеДействия КАК НаименованиеДействия
		|ИЗ
		|	РегистрСведений.ДлительныеДействияЗадача КАК ДлительныеДействияЗадача
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДлительныеДействия КАК ДлительныеДействия
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДлительныеДействияЭтап КАК ДлительныеДействияЭтап
		|			ПО ДлительныеДействия.УИДДействия = ДлительныеДействияЭтап.УИДДействия
		|		ПО ДлительныеДействияЗадача.УИДДействия = ДлительныеДействия.УИДДействия
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ВсеДействия
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НЕ ДлительныеДействия.ДействиеЗавершено
		|		КОНЕЦ
		|	И ДлительныеДействияЭтап.Миллисекунды > &Миллисекунды
		|	И ДлительныеДействияЗадача.Задача = &Задача
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДлительныеДействияЭтап.Миллисекунды";
	
	Запрос.УстановитьПараметр("Миллисекунды", 	СтаршеМиллисекунды);
	Запрос.УстановитьПараметр("ВсеДействия", 	ВсеДействия);
	Запрос.УстановитьПараметр("Задача", 		Задача);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ТекущиеДействияЗадачи()


Процедура КонтрольДлительныхДействий() Экспорт

	

КонецПроцедуры

Функция СоздатьДействие(ДействиеПриОкончании, СтруктураПараметров) Экспорт

	Если ДействиеПриОкончании = "ДоработкаДизайнера" Тогда
	
		Возврат РегистрыСведений.ДлительныеДействия.СоздатьДлительноеДействиеДляЗадачи(СтруктураПараметров.ЗадачаСсылка, СтруктураПараметров.НаименованиеДействия, ДействиеПриОкончании);	
	
	Иначе
	
		
	
	КонецЕсли;	

КонецФункции 

Функция СоздатьЭтап(УИДДействия, ОписаниеЭтапаДействия) Экспорт

	МенеджерЗаписи = РегистрыСведений.ДлительныеДействияЭтап.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УИДДействия 				= УИДДействия; 
	МенеджерЗаписи.Миллисекунды 			= ТекущаяУниверсальнаяДатаВМиллисекундах(); 
	МенеджерЗаписи.ОписаниеЭтапаДействия 	= ОписаниеЭтапаДействия; 
	
	МенеджерЗаписи.Записать();
	
	Возврат МенеджерЗаписи.Миллисекунды;

КонецФункции // СоздатьЭтап()

Функция ЗавершитьЭтап(УИДДействия, Милисекунды) Экспорт

	МенеджерЗаписи = РегистрыСведений.ДлительныеДействияЭтап.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УИДДействия 				= УИДДействия; 
	МенеджерЗаписи.Миллисекунды 			= Милисекунды; 
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Завершен 				= Истина;
	
	МенеджерЗаписи.Записать();
	
	Возврат Милисекунды;

КонецФункции // СоздатьЭтап()
